DocumentJournals/ДокументыПоЗапасам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоЗапасам</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПоступлениеЗапасовУслуг</xr:Item>
				<xr:Item>Document.ПеремещениеЗапасов</xr:Item>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
				<xr:Item>Document.ОприходованиеЗапасов</xr:Item>
				<xr:Item>Document.СписаниеЗапасов</xr:Item>
				<xr:Item>Document.ПриходныйОрдерНаЗапасы</xr:Item>
				<xr:Item>Document.РасходныйОрдерНаЗапасы</xr:Item>
				<xr:Item>Document.УстановкаЦенНоменклатуры</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.ПоступлениеЗапасовУслуг.Attribute.Склад</xr:Item>
						<xr:Item>Document.СписаниеЗапасов.Attribute.Склад</xr:Item>
						<xr:Item>Document.ОприходованиеЗапасов.Attribute.Склад</xr:Item>
						<xr:Item>Document.ИнвентаризацияЗапасов.Attribute.Склад</xr:Item>
						<xr:Item>Document.ПриходныйОрдерНаЗапасы.Attribute.Склад</xr:Item>
						<xr:Item>Document.РасходныйОрдерНаЗапасы.Attribute.Склад</xr:Item>
						<xr:Item>Document.ВозвратПоставщику.Attribute.Склад</xr:Item>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Склад</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ПоступлениеЗапасовУслуг.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ВозвратПоставщику.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступлениеЗапасовУслуг.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Организация</xr:Item>
						<xr:Item>Document.СписаниеЗапасов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОприходованиеЗапасов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИнвентаризацияЗапасов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПриходныйОрдерНаЗапасы.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходныйОрдерНаЗапасы.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратПоставщику.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоУмолчанию</Name>
					<Comment>Договор контрагента по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПоУмолчанию</Name>
					<Comment>Банковский счет по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогооблажения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DocumentJournals/ДокументыПоЗапасам/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ СОЗДАНИЯ ОТБОРОВ

// Процедура создает отбор по организации.
//
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

// Процедура создает отбор по складу.
//
&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Склад", Склад, ЗначениеЗаполнено(Склад));
	
КонецПроцедуры

// Процедура создает отбор по контрагенту.
//
&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Строка Из Метаданные.ЖурналыДокументов.ДокументыПоЗапасам.РегистрируемыеДокументы Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Строка.Синоним, Строка.Синоним);
		ТипыДокументов.Добавить(Строка.Синоним, Строка.Имя);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТипДокумента.
// 
Процедура ТипДокументаПриИзменении(Элемент)
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Контрагент", Контрагент);
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Склад", Склад);
		СтруктураПараметров.Вставить("ДоговорКонтрагента", ПолучитьОсновнойДоговор());
		
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Организация					= Настройки.Получить("Организация");
	ТипДокументаПредставление 	= Настройки.Получить("ТипДокументаПредставление");
	Контрагент				 	= Настройки.Получить("Контрагент");
	Склад			 			= Настройки.Получить("Склад");
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
    ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", Контрагент, ЗначениеЗаполнено(Контрагент));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Склад", Склад, ЗначениеЗаполнено(Склад));

КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Функция ПолучитьОсновнойДоговор()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ДоговорПоУмолчанию КАК Договор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Контрагент);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Договор;
	КонецЦикла;
	
КонецФункции
